I also tested just the templatefile function and it worked correctly

**/tmp/test/main.tf**
```
locals {
  yaml = templatefile("${path.root}/argocd-project.tpl", {
    project   = "test"
    namespace = "test"
    cluster   = "https://kubernetes.default.svc"
    repos     = ["repo1", "repo2"]
    config = {
      "x"   = "y"
      "foo" = "bar"
      "key" = "value"
    }
    labels = <<EOT
created-by: DmitrySemenov
  pm: VadikKuznetsov
  tm: Pavel Kusch
  lead-backend-developer: AlekseyErmolenko
  lead-frontend-developer: YaroslavGolovachev
  stack-backend: php
  stack-frontend: react
  ops-team: DmitrySemenov,DanilaKazakevich
  EOT
  })
}
```

**/tmp/test/argocd-project.tpl**
```
apiVersion: argoproj.io/v1alpha1
kind: AppProject
metadata:
  name: ${project}
  namespace: argo-cd
  labels:
  %{ for config_key, config_value in config }  ${config_key}:${config_value}
  %{ endfor ~}
spec:
  destinations:
  - namespace: ${namespace}
    server: ${cluster}
  orphanedResources:
    warn: true
  sourceRepos:
  %{ for repository in repos ~}
  - ${repository}
  %{ endfor ~}

```

```
on ☸ saritasa.rocks (argo-cd) /tmp/test on 🅰 (us-west-2) took 2s 
➜ terraform console
> local.yaml
apiVersion: argoproj.io/v1alpha1
kind: AppProject
metadata:
  name: test
  namespace: argo-cd
  labels:
    foo:bar
    key:value
    x:y
  spec:
  destinations:
  - namespace: test
    server: https://kubernetes.default.svc
  orphanedResources:
    warn: true
  sourceRepos:
    - repo1
    - repo2
  
>  
```

but same with kubectl provider


```
+ resource "kubectl_manifest" "argocd_project_manifest" {
      + api_version             = "argoproj.io/v1alpha1"
      + force_new               = true
      + id                      = (known after apply)
      + kind                    = "AppProject"
      + live_manifest_incluster = (sensitive value)
      + live_resource_version   = (known after apply)
      + live_uid                = (known after apply)
      + name                    = "harvey"
      + namespace               = "argo-cd"
      + resource_version        = (known after apply)
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<~EOT
            apiVersion: argoproj.io/v1alpha1
            kind: AppProject
            metadata:
              destinations:
              - namespace: harvey
                server: https://kubernetes.default.svc
              labels:
                foo: bar
                key: value
                x: true
              name: project
              namespace: argo-cd
              orphanedResources:
                warn: true
              sourceRepos:
              - git@github.com:project/project-crm-backend.git
              - git@github.com:project/project-crm-frontend.git
              spec: null
        EOT
      + yaml_incluster          = (sensitive value)
    }
```


Error: argo-cd/project failed to run apply: unable to decode "/tmp/343614183kubectl_manifest.yaml": resource.metadataOnlyObject.ObjectMeta: v1.ObjectMeta.Labels: ReadString: expects " or n, but found t, error found in #10 byte of ...|lue","x":true},"name|..., bigger context ...|t.svc"}],"labels":{"foo":"bar","key":"value","x":true},"name":"project","namespace":"argo-cd","orphan|...


